Question1 :
(A) Given the string 'great', use an appropriate index command that returns 'a'
from the string. Given s = ‘great’. (0.5 point)
Expected output: ‘a’

In [1]:
s = "great"
print(s[3])

a

Question1 
(B)Write a program to find out the second smallest number in the list given
below. (0.5 point)
li=[32, 3, 5, 8, 33, 7] & Expected output: 5

In [2]:

list1 = [32,3,5,8,33,7]

list1.sort()

secondsmall = list1[1]

print("Second smallest number is: " , secondsmall)

Second smallest number is:  5

Question1 :
(C) Find out the unique values of the list given below. (0.5 point)
mylist=[1,1,5,3,3,6,11,11] & Expected output: [1,5,3,6,11

In [3]:
import numpy as np
mylist=[1,1,5,3,3,6,11,11]

def unique(mylist):
    x = np.array(mylist)
    print(np.unique(x))
    
print("the unique values from list is")
unique(mylist)

the unique values from list is
[ 1  3  5  6 11]

Question1 :
(D)
Write a program to print cube root of 216 using appropriate syntax. (0.5
point)
Expected output: 6

In [4]:
var1= float(216)
print(var1**(1/3))

5.999999999999999

In [5]:
def cube_root(x):
        return x**(1/3)
print(cube_root(216))

5.999999999999999

QUESTION 2
Replace the value 'hello' in the below nested list with 'bye'. (1 point)
a = [1, 2, [3, 4, 'hello']] & Expected output: [1, 2, [3, 4, 'bye']]

In [6]:
a = [1, 2, [3, 4, 'hello']] 
print(a)
a[2][2]="bye"
print(a)

[1, 2, [3, 4, 'hello']]
[1, 2, [3, 4, 'bye']]

QUESTION 3
Given the below dictionary, write a program that returns [‘object0’]. (1 point)
dict = {'a':9, 'b':(2,3,1), 'c':['object0','object1','object2']}
Expected output: [‘object0’]

In [7]:
dict = {'a':9, 'b':(2,3,1), 'c':['object0','object1','object2']}
print(dict['c'][0])

object0

Question 4:
Write a program to calculate the area of a circle. The program should ask for an
appropriate input and print the computed area. (2 points)
a. Input text: Please enter the radius of the circle.
b. If the user enters a value of 5. The output should be: The area of the circle
is 78.54
c. This program should indicate that the input is invalid if the user enters a
character instead of a number as input. For instance if the user enters a
value of ‘a’ instead of 5 in the previous example the program should
prompt: Invalid input, please enter a number: _

In [8]:
π = 3.14  

Radius = float(input ("Please enter the radius of the circle: ")) 
area_of_the_circle = π * Radius * Radius 
print (" The area of circle is: ", area_of_the_circle)

Please enter the radius of the circle: 5
 The area of circle is:  78.5

QUESTION 5:
Write a program which will take two lists X & Y as input and it will return a list
having all the odd numbers present in the two lists. (Note:- common elements
can be repeated) (2 points)
Input list: X=[1,2,3,4,5] & Y=[5,6,7,8,9]
Expected Output: [1,3,5,5,7,9] or [1,3,5,7,9] both are accepted.

In [9]:
import numpy as np
X=np.array([1,2,3,4,5])
Y=np.array([5,6,7,8,9])
Z=[*X[X%2!=0], *Y[Y%2!=0]]
print(Z)

[1, 3, 5, 5, 7, 9]

QUESTION 6:
Write a function that prints the integers from 1 to 15. But for multiples of three
print "GREAT" instead of the number, and for the multiples of five print
"LEARNING". For numbers which are multiples of both three and five print
"GREATLEARNING".

In [11]:
def Greatlearning(i):        
    if i%3==0 and i%5==0:
        return ("GreatLearning")
    
    elif i%3==0:
        return ("Great")
    
    elif i%5==0:
        return ("Learning")
    else:
        return (i)
        
for i in range(1,16):
    print(Greatlearning(i))

1
2
Great
4
Learning
Great
7
8
Great
Learning
11
Great
13
14
GreatLearning

                                        PART 2

QUESTION1. Import necessary libraries and read the provided dataset (online_sales.csv) and
check the top 5 and random 5 samples of the dataframe.

In [18]:
import pandas as pd
df = pd.read_csv("online_sales (2).csv")
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
240002,558077,47590A,BLUE HAPPY BIRTHDAY BUNTING,12,6/26/11 10:59,5.45,13408.0,United Kingdom
240003,558077,82600,NO SINGING METAL SIGN,12,6/26/11 10:59,2.10,13408.0,United Kingdom
240004,558077,85123A,WHITE HANGING HEART T-LIGHT HOLDER,32,6/26/11 10:59,2.55,13408.0,United Kingdom
240005,558077,22746,POPPY'S PLAYHOUSE LIVINGROOM,12,6/26/11 10:59,2.10,13408.0,United Kingdom
240006,558077,23251,VINTAGE RED ENAMEL TRIM MUG,12,6/26/11 10:59,1.25,13408.0,Unit

In [14]:
df.sample()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
36523,539451,21212,PACK OF 72 RETROSPOT CAKE CASES,1,12/17/10 16:59,1.28,NaN,United Kingdom

In [15]:
df.sample(n=5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
219907,556108,23167,SMALL CERAMIC TOP STORAGE JAR,1,6/8/11 17:59,1.63,NaN,United Kingdom
55308,540986,22294,HEART FILIGREE DOVE SMALL,24,1/12/11 16:14,1.25,15291.0,United Kingdom
215400,555704,22469,HEART OF WICKER SMALL,12,6/6/11 15:06,1.65,14944.0,United Kingdom
206215,554917,22840,ROUND CAKE TIN VINTAGE RED,2,5/27/11 12:29,7.95,15104.0,United Kingdom
186509,552867,23109,LED TEA LIGHTS,6,5/12/11 8:36,2.89,15513.0,United Kingdom

In [7]:

df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom

Question 2:
Check info of the dataframe and write your observations. Comment on data
types and shape of the dataset.

In [21]:
df.shape

(240007, 8)

In [22]:
df.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

Question3:. Check for null values and report the percentage of null values of each column.
And drop the rows having null values in it.

In [23]:
percent_missing = df.isnull().sum() * 100 / len(df)
missing_value_df = pd.DataFrame({'column_name': df.columns,
                                 'percent_missing': percent_missing})
percent_missing

InvoiceNo       0.000000
StockCode       0.000000
Description     0.375406
Quantity        0.000000
InvoiceDate     0.000000
UnitPrice       0.000000
CustomerID     28.009600
Country         0.000000
dtype: float64

In [257]:
print(df['InvoiceNo'].isnull().sum())
print(df['StockCode'].isnull().sum())
print(df['Description'].isnull().sum())
print(df['Quantity'].isnull().sum())
print(df['InvoiceDate'].isnull().sum())
print(df['UnitPrice'].isnull().sum())
print(df['CustomerID'].isnull().sum())
print(df['Country'].isnull().sum())

0
0
901
0
0
0
67225
0

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240007 entries, 0 to 240006
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    240007 non-null  object
 1   StockCode    240007 non-null  object
 2   Description  239106 non-null  object
 3   Quantity     240007 non-null  int64
 4   InvoiceDate  240007 non-null  object
 5   UnitPrice    240007 non-null  float64
 6   CustomerID   172782 non-null  float64
 7   Country      240007 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 14.6+ MB

Question 4: Check the statistical summary of the dataset. (Use inbuilt functions)

In [25]:
print(df.describe())

            Quantity      UnitPrice     CustomerID
count  240007.000000  240007.000000  172782.000000
mean        9.277646       5.124265   15274.819941
std       223.061608     119.992279    1725.093177
min    -74215.000000       0.000000   12346.000000
25%         1.000000       1.250000   13842.000000
50%         3.000000       2.100000   15132.000000
75%        10.000000       4.210000   16814.000000
max     74215.000000   38970.000000   18287.000000

Question 5:Drop the instances having quantity less than zero.

In [26]:
df[df['Quantity']<0]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
141,C536379,D,Discount,-1,12/1/10 9:41,27.50,14527.0,United Kingdom
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,12/1/10 9:49,4.65,15311.0,United Kingdom
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,12/1/10 10:24,1.65,17548.0,United Kingdom
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,12/1/10 10:24,0.29,17548.0,United Kingdom
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,12/1/10 10:24,0.29,17548.0,United Kingdom
...,...,...,...,...,...,...,...,...
239404,C558048,M,Manual,-1,6/24/11 13:52,542.20,NaN,EIRE
239549,C558059,23243,SET OF TEA COFFEE SUGAR TINS PANTRY,-1,6/24/11 15:03,4.95,14194.0,United Kingdom
239550,C558059,82600,NO SINGING METAL SIGN,-2,6/24/11 15:03,1.85,14194.0,United Kingdom
239551,C558060,22988,SOLDIERS EGG CUP,-1,6/24/11 15:05,1.06,17809.0,United Kingdom
239552,C558061,23245,SET OF 3 REGENCY CAKE TINS,-1,6/24/11 15:15,4.95,12809.0,Portugal

Question 6: Check unique values of the country and report the name of the country that has
the highest number of instances/rows

In [27]:
df.describe(include = 'O').T

              count unique                                 top    freq
InvoiceNo    240007  12468                              537434     675
StockCode    240007   3645                              85123A    1294
Description  239106   3617  WHITE HANGING HEART T-LIGHT HOLDER    1319
InvoiceDate  240007  11240                       12/6/10 16:57     675
Country      240007     38                      United Kingdom  220279

In [28]:
pd.value_counts(df.Country)

United Kingdom          220279
Germany                   4208
France                    3642
EIRE                      3034
Spain                     1142
Netherlands               1142
Belgium                    933
Switzerland                708
Australia                  642
Portugal                   624
Norway                     378
Channel Islands            368
Cyprus                     353
Finland                    312
Italy                      309
Japan                      251
Hong Kong                  200
Sweden                     200
Poland                     187
Denmark                    184
Austria                    127
Singapore                  118
Iceland                    102
Greece                      85
Unspecified                 83
Canada                      68
Malta                       47
Lebanon                     45
Israel                      38
Lithuania                   35
European Community          32
Brazil                      32
United Arab Emirates        30
USA                         22
Bahrain                     19
Czech Republic              17
Saudi Arabia                10
Unit                         1
Name: Country, dtype: int64

Question 7: Create a new column with the name as ‘sales’ having total sales. The total sales
is defined as Quantity*UnitPrice.

In [29]:
df["Sales"] = (df["Quantity"] * df["UnitPrice"])

df.head(10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Sales
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom,20.34
5,536365,22752,SET 7 BABUSHKA NESTING BOXES,2,12/1/10 8:26,7.65,17850.0,United Kingdom,15.30
6,536365,21730,GLASS STAR FROSTED T-LIGHT HOLDER,6,12/1/10 8:26,4.25,17850.0,United Kingdom,25.50
7,536366,22633,HAND WARMER UNION JACK,6,12/1/10 8:28,1.85,17850.0,United Kingdom,11.10
8,536366,22632,HAND WARMER RED POLKA DOT,6,12/1/10 8:28,1.85,17850.0,United Kingdom,11.10
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,12/1/10 8:34,1.69,13047.0,United Kingdom,54.08

Question 8: Report the top 5 countries in terms of sales. (2 points)
a. Consider the size of sales.
b. Consider the mean value of sales.

In [30]:
df.groupby(["Country"]).sum().sort_values("Sales", ascending=False).head(5)

                Quantity    UnitPrice    CustomerID        Sales
Country
United Kingdom   1814801  1109573.911  2.387192e+09  3572911.301
Netherlands        88842     2877.440  1.633862e+07   125721.310
Germany            52566    15538.190  5.312239e+07   103525.900
EIRE               50077    26911.660  3.991843e+07    99384.270
France             49306    14662.730  4.594356e+07    87442.880

In [31]:
df.groupby(["Country"]).mean().sort_values("Sales", ascending=False).head(5)

              Quantity  UnitPrice    CustomerID       Sales
Country
Australia    77.116822   3.434548  12475.732087  123.164003
Netherlands  77.795096   2.519650  14307.020140  110.088713
Japan        69.513944   2.253904  12755.832669   84.194183
Sweden       79.330000   4.024050  14831.915000   77.243900
Denmark      18.853261   3.501359  12408.826087   51.285652

Question 9:Report the top 5 products which bring the highest sales. Use StockCode for
product information.

In [32]:
group = df.groupby(["StockCode"]).sum()
total_price = group["Sales"]
total_price.nlargest(5)

StockCode
22423     101062.44
DOT        87935.97
47566      57243.34
85123A     55274.90
22502      50357.47
Name: Sales, dtype: float64

Question 10:
    Convert the ‘InvoiceDate’ into a date format and report the month on which
the maximum sales occur?

In [33]:
import datetime
df['InvoiceDate']=pd.to_datetime(df['InvoiceDate']).dt.strftime('%m')
df.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Sales
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12,3.39,17850.0,United Kingdom,20.34

In [34]:
group = df.groupby(["InvoiceDate"]).sum()
total_price = group["Sales"]
total_price.nlargest(12)

InvoiceDate
12    748957.020
05    723333.510
03    683267.080
06    568316.290
01    560000.260
02    498062.650
04    493207.121
Name: Sales, dtype: float64